[
    {
        "chunk": "# Chapter 2 Starting at the beginning: the natural numbers\n\nIn this text, we will review the material you have learnt in high school\nand in elementary calculus classes, but as rigorously as possible. To do\nso we will have to begin at the very basics - indeed, we will go back to the\nconcept of numbers and what their properties are. Of course, you have\ndealt with numbers for over ten years and you know how to manipulate\nthe rules of algebra to simplify any expression involving numbers, but\nwe will now turn to a more fundamental issue, which is: why do the rules\nof algebra work at all? For instance, why is it true that a(b+c) is equal\nto ab + ac for any three numbers a, b, c? This is not an arbitrary choice\nof rule; it can be proven from more primitive, and more fundamental,\nproperties of the number system. This will teach you a new skill - how\nto prove complicated properties from simpler ones. You will find that\neven though a statement may be \"obvious\", it may not be easy to prove;\nthe m",
        "page": 0
    },
    {
        "chunk": "aterial here will give you plenty of practice in doing so, and in the\nprocess will lead you to think about why an obvious statement really is\nobvious. One skill in particular that you will pick up here is the use of\nmathematical induction, which is a basic tool in proving things in many\nareas of mathematics.\n\nSo in the first few chapters we will re-acquaint you with various\nnumber systems that are used in real analysis. In increasing order of\nsophistication, they are the natural numbers N; the integers Z; the ra-\ntionals Q, and the real numbers R. (There are other number systems\nsuch as the complex numbers C, but we will not study them until Sec-\ntion 11.26.) The natural numbers {0,1,2, ... } are the most primitive of\nthe number systems, but they are used to build the integers, which in\nturn are used to build the rationals. Furthermore, the rationals are used\nto build the real numbers, which are in turn used to build the complex\nnumbers. Thus to begin at the very beginning, we must loo",
        "page": 0
    },
    {
        "chunk": "k at the\n\n<!-- PageFooter=\"@ Springer Science+Business Media Singapore 2016 and Hindustan Book Agency 2015\" -->\n<!-- PageFooter=\"T. Tao, Analysis I, Texts and Readings in Mathematics 37, DOI 10.1007/978-981-10-1789-6_2\" -->\n<!-- PageNumber=\"13\" -->\n<!-- PageBreak -->\n\n<!-- PageNumber=\"14\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nnatural numbers. We will consider the following question: how does one\nactually define the natural numbers? (This is a very different question\nfrom how to use the natural numbers, which is something you of course\nknow how to do very well. It's like the difference between knowing how\nto use, say, a computer, versus knowing how to build that computer.)\n\nThis question is more difficult to answer than it looks. The basic\nproblem is that you have used the natural numbers for so long that\nthey are embedded deeply into your mathematical thinking, and you\ncan make various implicit assumptions about these numbers (e.g., that\na + b is ",
        "page": 1
    },
    {
        "chunk": "always equal to b + a) without even aware that you are doing\nso; it is difficult to let go and try to inspect this number system as if it\nis the first time you have seen it. So in what follows I will have to ask\nyou to perform a rather difficult task: try to set aside, for the moment,\neverything you know about the natural numbers; forget that you know\nhow to count, to add, to multiply, to manipulate the rules of algebra,\netc. We will try to introduce these concepts one at a time and identify\nexplicitly what our assumptions are as we go along - and not allow our-\nselves to use more \"advanced\" tricks such as the rules of algebra until we\nhave actually proven them. This may seem like an irritating constraint,\nespecially as we will spend a lot of time proving statements which are\n\"obvious\", but it is necessary to do this suspension of known facts to\navoid circularity (e.g., using an advanced fact to prove a more elemen-\ntary fact, and then later using the elementary fact to prove the advan",
        "page": 1
    },
    {
        "chunk": "ced\nfact). Also, this exercise will be an excellent way to affirm the founda-\ntions of your mathematical knowledge. Furthermore, practicing your\nproofs and abstract thinking here will be invaluable when we move on\nto more advanced concepts, such as real numbers, functions, sequences\nand series, differentials and integrals, and so forth. In short, the results\nhere may seem trivial, but the journey is much more important than\nthe destination, for now. (Once the number systems are constructed\nproperly, we can resume using the laws of algebra etc. without having\nto rederive them each time.)\n\nWe will also forget that we know the decimal system, which of course\nis an extremely convenient way to manipulate numbers, but it is not\nsomething which is fundamental to what numbers are. (For instance,\none could use an octal or binary system instead of the decimal system,\nor even the Roman numeral system, and still get exactly the same set\nof numbers.) Besides, if one tries to fully explain what the ",
        "page": 1
    },
    {
        "chunk": "decimal\nnumber system is, it isn't as natural as you might think. Why is 00423\nthe same number as 423, but 32400 isn't the same number as 324? Why\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"15\" -->\n<!-- PageHeader=\"2.1. The Peano axioms\" -->\n\nis 123.4444 ... a real number, while ... 444.321 is not? And why do we\nhave to carry of digits when adding or multiplying? Why is 0.999 ... the\nsame number as 1? What is the smallest positive real number? Isn't\nit just 0.00 ... 001? So to set aside these problems, we will not try to\nassume any knowledge of the decimal system, though we will of course\nstill refer to numbers by their familiar names such as 1,2,3, etc. instead\nof using other notation such as I,II,III or 0++, (0++)++, ((0++)++)++\n(see below) so as not to be needlessly artificial. For completeness, we\nreview the decimal system in an Appendix (§B).\n\n\n## 2.1 The Peano axioms\n\nWe now present one standard way to define the natural numbers, in\nterms of the Peano axioms, which were first laid out",
        "page": 2
    },
    {
        "chunk": " by Guiseppe Peano\n(1858-1932). This is not the only way to define the natural numbers.\nFor instance, another approach is to talk about the cardinality of finite\nsets, for instance one could take a set of five elements and define 5 to be\nthe number of elements in that set. We shall discuss this alternate ap-\nproach in Section 3.6. However, we shall stick with the Peano axiomatic\napproach for now.\n\nHow are we to define what the natural numbers are? Informally, we\ncould say\n\nDefinition 2.1.1. (Informal) A natural number is any element of the\nset\n\nN := {0,1,2,3,4, ... },\n\nwhich is the set of all the numbers created by starting with 0 and then\ncounting forward indefinitely. We call N the set of natural numbers.\n\nRemark 2.1.2. In some texts the natural numbers start at 1 instead of\n0, but this is a matter of notational convention more than anything else.\nIn this text we shall refer to the set {1,2, 3, ... } as the positive integers\nZ+ rather than the natural numbers. Natural numbers are som",
        "page": 2
    },
    {
        "chunk": "etimes\nalso known as whole numbers.\n\nIn a sense, this definition solves the problem of what the natural\nnumbers are: a natural number is any element of the set1 N. However,\n\n1Strictly speaking, there is another problem with this informal definition: we have\nnot yet defined what a \"set\" is, or what \"element of\" is. Thus for the rest of this\nchapter we shall avoid mention of sets and their elements as much as possible, except\nin informal discussion.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"16\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nit is not really that satisfactory, because it begs the question of what\nN is. This definition of \"start at 0 and count indefinitely\" seems like\nan intuitive enough definition of N, but it is not entirely acceptable,\nbecause it leaves many questions unanswered. For instance: how do\nwe know we can keep counting indefinitely, without cycling back to 0?\nAlso, how do you perform operations such as addition, multiplication,\nor exp",
        "page": 3
    },
    {
        "chunk": "onentiation?\n\nWe can answer the latter question first: we can define complicated\noperations in terms of simpler operations. Exponentiation is nothing\nmore than repeated multiplication: 53 is nothing more than three fives\nmultiplied together. Multiplication is nothing more than repeated addi-\ntion; 5 x 3 is nothing more than three fives added together. (Subtraction\nand division will not be covered here, because they are not operations\nwhich are well-suited to the natural numbers; they will have to wait for\nthe integers and rationals, respectively.) And addition? It is nothing\nmore than the repeated operation of counting forward, or incrementing.\nIf you add three to five, what you are doing is incrementing five three\ntimes. On the other hand, incrementing seems to be a fundamental op-\neration, not reducible to any simpler operation; indeed, it is the first\noperation one learns on numbers, even before learning to add.\n\nThus, to define the natural numbers, we will use two fundamental\nconce",
        "page": 3
    },
    {
        "chunk": "pts: the zero number 0, and the increment operation. In deference\nto modern computer languages, we will use n++ to denote the increment\nor successor of n, thus for instance 3++ = 4, (3++)++ = 5, etc. This\nis a slightly different usage from that in computer languages such as C,\nwhere n++ actually redefines the value of n to be its successor; however\nin mathematics we try not to define a variable more than once in any\ngiven setting, as it can often lead to confusion; many of the statements\nwhich were true for the old value of the variable can now become false,\nand vice versa.\n\nSo, it seems like we want to say that N consists of 0 and everything\nwhich can be obtained from 0 by incrementing: N should consist of the\nobjects\n\n0,0++,(0++)++,((0++)++)++, etc.\n\nIf we start writing down what this means about the natural numbers,\nwe thus see that we should have the following axioms concerning 0 and\nthe increment operation ++:\n\nAxiom 2.1. 0 is a natural number.\n\n<!-- PageBreak -->\n\n<!-- PageNumber",
        "page": 4
    },
    {
        "chunk": "=\"17\" -->\n<!-- PageHeader=\"2.1. The Peano axioms\" -->\n\nAxiom 2.2. If n is a natural number, then n++ is also a natural num-\nber.\n\nThus for instance, from Axiom 2.1 and two applications of Axiom 2.2,\nwe see that (0++)++ is a natural number. Of course, this notation will\nbegin to get unwieldy, so we adopt a convention to write these numbers\nin more familiar notation:\n\nDefinition 2.1.3. We define 1 to be the number 0++, 2 to be the\nnumber (0++)++, 3 to be the number ((0++)++)++, etc. (In other\nwords, 1 := 0++, 2 := 14+, 3 := 2++, etc. In this text I use \"x := y\"\nto denote the statement that x is defined to equal y.)\n\nThus for instance, we have\n\nProposition 2.1.4. 3 is a natural number.\n\nProof. By Axiom 2.1, 0 is a natural number. By Axiom 2.2, 0++ = 1 is\na natural number. By Axiom 2.2 again, 1++ = 2 is a natural number.\nBy Axiom 2.2 again, 2++ = 3 is a natural number.\n☐\n\nIt may seem that this is enough to describe the natural numbers.\nHowever, we have not pinned down completely the behavi",
        "page": 4
    },
    {
        "chunk": "or of N:\n\nExample 2.1.5. Consider a number system which consists of the num-\nbers 0, 1, 2,3, in which the increment operation wraps back from 3 to\n0. More precisely 0++ is equal to 1, 1++ is equal to 2, 2++ is equal\nto 3, but 3++ is equal to 0 (and also equal to 4, by definition of 4).\nThis type of thing actually happens in real life, when one uses a com-\nputer to try to store a natural number: if one starts at 0 and performs\nthe increment operation repeatedly, eventually the computer will over-\nflow its memory and the number will wrap around back to 0 (though\nthis may take quite a large number of incrementation operations, for\ninstance a two-byte representation of an integer will wrap around only\nafter 65, 536 increments). Note that this type of number system obeys\nAxiom 2.1 and Axiom 2.2, even though it clearly does not correspond\nto what we intuitively believe the natural numbers to be like.\n\nTo prevent this sort of \"wrap-around issue\" we will impose another\naxiom:\n\nAxiom 2.3. 0 is ",
        "page": 4
    },
    {
        "chunk": "not the successor of any natural number; i.e., we have\nn++ + 0 for every natural number n.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"18\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nNow we can show that certain types of wrap-around do not occur:\nfor instance we can now rule out the type of behavior in Example 2.1.5\nusing\n\nProposition 2.1.6. 4 is not equal to 0.\n\nDon't laugh! Because of the way we have defined 4 - it is the in-\ncrement of the increment of the increment of the increment of 0 - it is\nnot necessarily true a priori that this number is not the same as zero,\neven if it is \"obvious\". (\"a priori\" is Latin for \"beforehand\" - it refers to\nwhat one already knows or assumes to be true before one begins a proof\nor argument. The opposite is \"a posteriori\" - what one knows to be\ntrue after the proof or argument is concluded.) Note for instance that\nin Example 2.1.5, 4 was indeed equal to 0, and that in a standard two-\nbyte computer representation of a natur",
        "page": 5
    },
    {
        "chunk": "al number, for instance, 65536\nis equal to 0 (using our definition of 65536 as equal to 0 incremented\nsixty-five thousand, five hundred and thirty-six times).\n\nProof. By definition, 4 = 3++. By Axioms 2.1 and 2.2, 3 is a natural\nnumber. Thus by Axiom 2.3, 3++ + 0, i.e., 4 + 0.\n☐\n\nHowever, even with our new axiom, it is still possible that our num-\nber system behaves in other pathological ways:\n\nExample 2.1.7. Consider a number system consisting of five numbers\n0,1,2,3,4, in which the increment operation hits a \"ceiling\" at 4. More\nprecisely, suppose that 0++ = 1, 1++ = 2, 2++ = 3, 3++ = 4, but\n4++ = 4 (or in other words that 5 = 4, and hence 6 = 4, 7 = 4, etc.).\nThis does not contradict Axioms 2.1,2.2,2.3. Another number system\nwith a similar problem is one in which incrementation wraps around,\nbut not to zero, e.g. suppose that 4++ = 1 (so that 5 = 1, then 6 = 2,\netc.).\n\nThere are many ways to prohibit the above types of behavior from\nhappening, but one of the simplest is to assume th",
        "page": 5
    },
    {
        "chunk": "e following axiom:\n\nAxiom 2.4. Different natural numbers must have different successors;\ni.e., if n, m are natural numbers and n # m, then n++ + m++. Equiv-\nalently2, if n++ = m++, then we must have n = m.\n\n2This is an example of reformulating an implication using its contrapositive; see\nSection A.2 for more details. In the converse direction, if n = m, then n++ = m++;\nthis is the axiom of substitution (see Section A.7) applied to the operation ++.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"19\" -->\n<!-- PageHeader=\"2.1. The Peano axioms\" -->\n\nThus, for instance, we have\n\nProposition 2.1.8. 6 is not equal to 2.\n\nProof. Suppose for sake of contradiction that 6 = 2. Then 5++ = 1++,\nso by Axiom 2.4 we have 5 = 1, so that 4++ = 0++. By Axiom 2.4 again\nwe then have 4 = 0, which contradicts our previous proposition.\n☐\n\nAs one can see from this proposition, it now looks like we can keep all\nof the natural numbers distinct from each other. There is however still\none more problem: while the axioms (p",
        "page": 6
    },
    {
        "chunk": "articularly Axioms 2.1 and 2.2)\nallow us to confirm that 0, 1, 2, 3, ... are distinct elements of N, there is\nthe problem that there may be other \"rogue\" elements in our number\nsystem which are not of this form:\n\nExample 2.1.9. (Informal) Suppose that our number system N con-\nsisted of the following collection of integers and half-integers:\n\nN := {0,0.5, 1, 1.5, 2, 2.5, 3, 3.5, .. . }.\n\n(This example is marked \"informal\" since we are using real numbers,\nwhich we're not supposed to use yet.) One can check that Axioms 2.1-\n2.4 are still satisfied for this set.\n\nWhat we want is some axiom which says that the only numbers in N\nare those which can be obtained from 0 and the increment operation -\nin order to exclude elements such as 0.5. But it is difficult to quantify\nwhat we mean by \"can be obtained from\" without already using the\nnatural numbers, which we are trying to define. Fortunately, there is an\ningenious solution to try to capture this fact:\n\nAxiom 2.5 (Principle of mathematical in",
        "page": 6
    },
    {
        "chunk": "duction). Let P(n) be any\nproperty pertaining to a natural number n. Suppose that P(0) is true,\nand suppose that whenever P(n) is true, P(n++) is also true. Then\nP(n) is true for every natural number n.\n\nRemark 2.1.10. We are a little vague on what \"property\" means at\nthis point, but some possible examples of P(n) might be \"n is even\";\n\"n is equal to 3\"; \"n solves the equation (n + 1)2 = n2 + 2n + 1\"; and\nso forth. Of course we haven't defined many of these concepts yet, but\nwhen we do, Axiom 2.5 will apply to these properties. (A logical remark:\nBecause this axiom refers not just to variables, but also properties, it is\nof a different nature than the other four axioms; indeed, Axiom 2.5\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"20\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nshould technically be called an axiom schema rather than an axiom - it\nis a template for producing an (infinite) number of axioms, rather than\nbeing a single axiom in its own right. To",
        "page": 7
    },
    {
        "chunk": " discuss this distinction further\nis far beyond the scope of this text, though, and falls in the realm of\nlogic.)\n\nThe informal intuition behind this axiom is the following. Suppose\nP(n) is such that P(0) is true, and such that whenever P(n) is true,\nthen P(n++) is true. Then since P(0) is true, P(0++) = P(1) is true.\nSince P(1) is true, P(1++) = P(2) is true. Repeating this indefinitely,\nwe see that P(0), P(1), P(2), P(3), etc. are all true - however this\nline of reasoning will never let us conclude that P(0.5), for instance, is\ntrue. Thus Axiom 2.5 should not hold for number systems which contain\n\"unnecessary\" elements such as 0.5. (Indeed, one can give a \"proof\" of\nthis fact. Apply Axiom 2.5 to the property P(n) = n \"is not a half-\ninteger\", i.e., an integer plus 0.5. Then P(0) is true, and if P(n) is true,\nthen P(n++) is true. Thus Axiom 2.5 asserts that P(n) is true for all\nnatural numbers n, i.e., no natural number can be a half-integer. In\nparticular, 0.5 cannot be a natural num",
        "page": 7
    },
    {
        "chunk": "ber. This \"proof\" is not quite\ngenuine, because we have not defined such notions as \"integer\", \"half-\ninteger\", and \"0.5\" yet, but it should give you some idea as to how the\nprinciple of induction is supposed to prohibit any numbers other than\nthe \"true\" natural numbers from appearing in N.)\n\nThe principle of induction gives us a way to prove that a property\nP(n) is true for every natural number n. Thus in the rest of this text\nwe will see many proofs which have a form like this:\n\nProposition 2.1.11. A certain property P(n) is true for every natural\nnumber n.\n\nProof. We use induction. We first verify the base case n = 0, i.e., we\nprove P(0). (Insert proof of P(0) here). Now suppose inductively that n\nis a natural number, and P(n) has already been proven. We now prove\nP(n++). (Insert proof of P(n++), assuming that P(n) is true, here).\nThis closes the induction, and thus P(n) is true for all numbers n.\n☐\n\nOf course we will not necessarily use the exact template, wording,\nor order in the ",
        "page": 7
    },
    {
        "chunk": "above type of proof, but the proofs using induction will\ngenerally be something like the above form. There are also some other\nvariants of induction which we shall encounter later, such as backwards\ninduction (Exercise 2.2.6), strong induction (Proposition 2.2.14), and\ntransfinite induction (Lemma 8.5.15).\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"21\" -->\n<!-- PageHeader=\"2.1. The Peano axioms\" -->\n\nAxioms 2.1-2.5 are known as the Peano axioms for the natural num-\nbers. They are all very plausible, and so we shall make\n\nAssumption 2.6. (Informal) There exists a number system N, whose\nelements we will call natural numbers, for which Axioms 2.1-2.5 are\ntrue.\n\nWe will make this assumption a bit more precise once we have laid\ndown our notation for sets and functions in the next chapter.\n\nRemark 2.1.12. We will refer to this number system N as the natural\nnumber system. One could of course consider the possibility that there\nis more than one natural number system, e.g., we could have the Hindu-",
        "page": 8
    },
    {
        "chunk": "\nArabic number system {0,1,2,3, ... } and the Roman number system\n{O, I, II, III, IV,V,VI, ... }, and if we really wanted to be annoying we\ncould view these number systems as different. But these number systems\nare clearly equivalent (the technical term is isomorphic), because one\ncan create a one-to-one correspondence 0 > 0, 1 <> I, 2 > II, etc.\nwhich maps the zero of the Hindu-Arabic system with the zero of the\nRoman system, and which is preserved by the increment operation (e.g.,\nif 2 corresponds to II, then 2++ will correspond to II++). For a more\nprecise statement of this type of equivalence, see Exercise 3.5.13. Since\nall versions of the natural number system are equivalent, there is no\npoint in having distinct natural number systems, and we will just use a\nsingle natural number system to do mathematics.\n\nWe will not prove Assumption 2.6 (though we will eventually include\nit in our axioms for set theory, see Axiom 3.7), and it will be the only\nassumption we will ever make about o",
        "page": 8
    },
    {
        "chunk": "ur numbers. A remarkable ac-\ncomplishment of modern analysis is that just by starting from these five\nvery primitive axioms, and some additional axioms from set theory, we\ncan build all the other number systems, create functions, and do all the\nalgebra and calculus that we are used to.\n\nRemark 2.1.13. (Informal) One interesting feature about the natural\nnumbers is that while each individual natural number is finite, the set of\nnatural numbers is infinite; i.e., N is infinite but consists of individually\nfinite elements. (The whole is greater than any of its parts.) There\nare no infinite natural numbers; one can even prove this using Axiom\n2.5, provided one is comfortable with the notions of finite and infinite.\n(Clearly 0 is finite. Also, if n is finite, then clearly n++ is also finite.\nHence by Axiom 2.5, all natural numbers are finite.) So the natural\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"22\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nnumbers can app",
        "page": 9
    },
    {
        "chunk": "roach infinity, but never actually reach it; infinity is\nnot one of the natural numbers. (There are other number systems which\nadmit \"infinite\" numbers, such as the cardinals, ordinals, and p-adics,\nbut they do not obey the principle of induction, and in any event are\nbeyond the scope of this text.)\n\nRemark 2.1.14. Note that our definition of the natural numbers is ax-\niomatic rather than constructive. We have not told you what the natural\nnumbers are (so we do not address such questions as what the numbers\nare made of, are they physical objects, what do they measure, etc.) -\nwe have only listed some things you can do with them (in fact, the only\noperation we have defined on them right now is the increment one) and\nsome of the properties that they have. This is how mathematics works\n\\- it treats its objects abstractly, caring only about what properties the\nobjects have, not what the objects are or what they mean. If one wants\nto do mathematics, it does not matter whether a natural numb",
        "page": 9
    },
    {
        "chunk": "er means\na certain arrangement of beads on an abacus, or a certain organization\nof bits in a computer's memory, or some more abstract concept with no\nphysical substance; as long as you can increment them, see if two of them\nare equal, and later on do other arithmetic operations such as add and\nmultiply, they qualify as numbers for mathematical purposes (provided\nthey obey the requisite axioms, of course). It is possible to construct\nthe natural numbers from other mathematical objects - from sets, for\ninstance - but there are multiple ways to construct a working model of\nthe natural numbers, and it is pointless, at least from a mathematician's\nstandpoint, as to argue about which model is the \"true\" one - as long as\nit obeys all the axioms and does all the right things, that's good enough\nto do maths.\n\nRemark 2.1.15. Historically, the realization that numbers could be\ntreated axiomatically is very recent, not much more than a hundred\nyears old. Before then, numbers were generally underst",
        "page": 9
    },
    {
        "chunk": "ood to be in-\nextricably connected to some external concept, such as counting the\ncardinality of a set, measuring the length of a line segment, or the mass\nof a physical object, etc. This worked reasonably well, until one was\nforced to move from one number system to another; for instance, under-\nstanding numbers in terms of counting beads, for instance, is great for\nconceptualizing the numbers 3 and 5, but doesn't work so well for -3\nor 1/3 or v2 or 3 + 4i; thus each great advance in the theory of num-\n☒\nbers - negative numbers, irrational numbers, complex numbers, even\nthe number zero - led to a lot of unnecessary philosophical anguish.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"23\" -->\n<!-- PageHeader=\"2.1. The Peano axioms\" -->\n\nThe great discovery of the late nineteenth century was that numbers\ncan be understood abstractly via axioms, without necessarily needing a\nconcrete model; of course a mathematician can use any of these models\nwhen it is convenient, to aid his or her intuition and",
        "page": 10
    },
    {
        "chunk": " understanding, but\nthey can also be just as easily discarded when they begin to get in the\nway.\n\nOne consequence of the axioms is that we can now define sequences\nrecursively. Suppose we want to build a sequence a0, a1, a2,... of num-\nbers by first defining a0 to be some base value, e.g., a0 := c for some\nnumber c, and then by letting a1 be some function of a0, a1 := f0(a0),\na2 be some function of a1, a2 := f1(a1), and so forth. In general, we\nset an++ := fn(an) for some function fn from N to N. By using all\nthe axioms together we will now conclude that this procedure will give\na single value to the sequence element an for each natural number n.\nMore precisely3:\n\nProposition 2.1.16 (Recursive definitions). Suppose for each natural\nnumber n, we have some function fn : N -> N from the natural numbers\nto the natural numbers. Let c be a natural number. Then we can assign\na unique natural number an to each natural number n, such that a0 = c\nand an++ = fn(an) for each natural number n.\n\nPro",
        "page": 10
    },
    {
        "chunk": "of. (Informal) We use induction. We first observe that this proce-\ndure gives a single value to a0, namely c. (None of the other defini-\ntions an++ := fn(an) will redefine the value of a0, because of Axiom\n2.3.) Now suppose inductively that the procedure gives a single value\nto an. Then it gives a single value to an++, namely ant := fn(an).\n(None of the other definitions am++ := fm(am) will redefine the value\nof an++, because of Axiom 2.4.) This completes the induction, and so\nan is defined for each natural number n, with a single value assigned to\neach an.\n☐\n\nNote how all of the axioms had to be used here. In a system which\nhad some sort of wrap-around, recursive definitions would not work\n\n3Strictly speaking, this proposition requires one to define the notion of a function,\nwhich we shall do in the next chapter. However, this will not be circular, as the\nconcept of a function does not require the Peano axioms. Proposition 2.1.16 can be\nformalized more rigorously in the language of se",
        "page": 10
    },
    {
        "chunk": "t theory; see Exercise 3.5.12.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"24\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nbecause some elements of the sequence would constantly be redefined.\nFor instance, in Example 2.1.5, in which 3++ = 0, then there would\nbe (at least) two conflicting definitions for a0, either c or f3(a3)). In\na system which had superfluous elements such as 0.5, the element a0.5\nwould never be defined.\n\nRecursive definitions are very powerful; for instance, we can use them\nto define addition and multiplication, to which we now turn.\n\n\n## 2.2 Addition\n\nThe natural number system is very bare right now: we have only one\noperation - increment - and a handful of axioms. But now we can build\nup more complex operations, such as addition.\n\nThe way it works is the following. To add three to five should be the\nsame as incrementing five three times - this is one increment more than\nadding two to five, which is one increment more than adding one to f",
        "page": 11
    },
    {
        "chunk": "ive,\nwhich is one increment more than adding zero to five, which should just\ngive five. So we give a recursive definition for addition as follows.\n\nDefinition 2.2.1 (Addition of natural numbers). Let m be a natural\nnumber. To add zero to m, we define 0 + m := m. Now suppose\ninductively that we have defined how to add n to m. Then we can add\nn++ to m by defining (n++) + m := (n +m)++.\n\nThus 0+m is m, 1+m =(0++)+m is m++; 2+m = (1++) +m =\n(m++)++; and so forth; for instance we have 2 + 3 = (3++)++ =\n4++ = 5. From our discussion of recursion in the previous section\nwe see that we have defined n + m for every natural number n. Here\nwe are specializing the previous general discussion to the setting where\nan = n+m and fn(an) = an++. Note that this definition is asymmetric:\n3 + 5 is incrementing 5 three times, while 5 + 3 is incrementing 3 five\ntimes. Of course, they both yield the same value of 8. More generally, it\nis a fact (which we shall prove shortly) that a + b = b+ a for all natural\nn",
        "page": 11
    },
    {
        "chunk": "umbers a, b, although this is not immediately clear from the definition.\n\nNotice that we can prove easily, using Axioms 2.1, 2.2, and induction\n(Axiom 2.5), that the sum of two natural numbers is again a natural\nnumber (why?).\n\nRight now we only have two facts about addition: that 0 + m = m,\nand that (n++) + m = (n +m)++. Remarkably, this turns out to be\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"25\" -->\n<!-- PageHeader=\"2.2. Addition\" -->\n\nenough to deduce everything else we know about addition. We begin\nwith some basic lemmas4.\n\nLemma 2.2.2. For any natural number n, n +0 = n.\n\nNote that we cannot deduce this immediately from 0 + m = m be-\ncause we do not know yet that a + b = b + a.\n\nProof. We use induction. The base case 0 + 0 = 0 follows since we\nknow that 0 + m = m for every natural number m, and 0 is a natural\nnumber. Now suppose inductively that n + 0 = n. We wish to show\nthat (n++)+0 = n++. But by definition of addition, (n++) +0 is equal\nto (n + 0)++, which is equal to n++ since n",
        "page": 12
    },
    {
        "chunk": " +0 = n. This closes the\ninduction.\n☐\n\nLemma 2.2.3. For any natural numbers n and m, n + (m++) = (n +\nm)++.\n\nAgain, we cannot deduce this yet from (n++) + m = (n +m)++\nbecause we do not know yet that a + b = b + a.\n\nProof. We induct on n (keeping m fixed). We first consider the base\ncase n = 0. In this case we have to prove 0 + (m++) = (0 + m)++.\nBut by definition of addition, 0 + (m++) = m++ and 0 + m = m, so\nboth sides are equal to m++ and are thus equal to each other. Now\nwe assume inductively that n + (m+) = (n +m)++; we now have to\nshow that (n++)+(m++) = ((n++)+m)++. The left-hand side is (n+\n(m++))++ by definition of addition, which is equal to ((n +m)++)++\nby the inductive hypothesis. Similarly, we have (n++)+m = (n+m)++\nby the definition of addition, and so the right-hand side is also equal to\n((n + m)++)++. Thus both sides are equal to each other, and we have\nclosed the induction.\n☐\n\n4From a logical point of view, there is no difference between a lemma, proposition,\ntheorem, ",
        "page": 12
    },
    {
        "chunk": "or corollary - they are all claims waiting to be proved. However, we use\nthese terms to suggest different levels of importance and difficulty. A lemma is an\neasily proved claim which is helpful for proving other propositions and theorems, but\nis usually not particularly interesting in its own right. A proposition is a statement\nwhich is interesting in its own right, while a theorem is a more important statement\nthan a proposition which says something definitive on the subject, and often takes\nmore effort to prove than a proposition or lemma. A corollary is a quick consequence\nof a proposition or theorem that was proven recently.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"26\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nAs a particular corollary of Lemma 2.2.2 and Lemma 2.2.3 we see\nthat n++=n+1 (why?).\n\nAs promised earlier, we can now prove that a + b = b + a.\n\nProposition 2.2.4 (Addition is commutative). For any natural num-\nbers n and m, n +m = m+n.\n\nProof.",
        "page": 13
    },
    {
        "chunk": " We shall use induction on n (keeping m fixed). First we do the\nbase case n = 0, i.e., we show 0 + m = m + 0. By the definition of\naddition, 0 + m = m, while by Lemma 2.2.2, m + 0 = m. Thus the\nbase case is done. Now suppose inductively that n + m = m +n, now\nwe have to prove that (n++) + m = m + (n++) to close the induction.\nBy the definition of addition, (n++) + m = (n +m)++. By Lemma\n2.2.3, m + (n++) = (m +n)++, but this is equal to (n + m)++ by the\ninductive hypothesis n + m = m + n. Thus (n++) + m = m + (n++)\nand we have closed the induction.\n☐\n\nProposition 2.2.5 (Addition is associative). For any natural numbers\na, b, c, we have (a + b) + c = a + (b+c).\n\nProof. See Exercise 2.2.1.\n☐\n\nBecause of this associativity we can write sums such as a + b + c\nwithout having to worry about which order the numbers are being added\ntogether.\n\nNow we develop a cancellation law.\n\nProposition 2.2.6 (Cancellation law). Let a, b, c be natural numbers\nsuch that a + b = a +c. Then we have b = c.\n\nNote",
        "page": 13
    },
    {
        "chunk": " that we cannot use subtraction or negative numbers yet to prove\nthis proposition, because we have not developed these concepts yet. In\nfact, this cancellation law is crucial in letting us define subtraction (and\nthe integers) later on in this text, because it allows for a sort of \"virtual\nsubtraction\" even before subtraction is officially defined.\n\nProof. We prove this by induction on a. First consider the base case\na = 0. Then we have 0 + b = 0+ c, which by definition of addition\nimplies that b = c as desired. Now suppose inductively that we have the\ncancellation law for a (so that a + b = a + c implies b = c); we now have\nto prove the cancellation law for a++. In other words, we assume that\n(a++) +b = (a++) +c and need to show that b = c. By the definition\nof addition, (a++) +b = (a+b)++ and (a++) +c = (a+c)++ and so\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"27\" -->\n<!-- PageHeader=\"2.2. Addition\" -->\n\nwe have (a +b)++ = (a +c)++. By Axiom 2.4, we have a + b = a + c.\nSince we already ha",
        "page": 14
    },
    {
        "chunk": "ve the cancellation law for a, we thus have b = c as\ndesired. This closes the induction.\n☐\n\nWe now discuss how addition interacts with positivity.\n\nDefinition 2.2.7 (Positive natural numbers). A natural number n is\nsaid to be positive iff it is not equal to 0. (\"iff\" is shorthand for \"if and\nonly if\" - see Section A.1).\n\nProposition 2.2.8. If a is positive and b is a natural number, then a+b\nis positive (and hence b + a is also, by Proposition 2.2.4).\n\nProof. We use induction on b. If b = 0, then a + b = a + 0 = a, which\nis positive, so this proves the base case. Now suppose inductively that\na + b is positive. Then a + (b++) = (a+b)++, which cannot be zero by\nAxiom 2.3, and is hence positive. This closes the induction.\n☐\n\nCorollary 2.2.9. If a and b are natural numbers such that a + b = 0,\nthen a = 0 and b = 0.\n\nProof. Suppose for sake of contradiction that a # 0 or b + 0. If a +0\nthen a is positive, and hence a +b = 0 is positive by Proposition 2.2.8, a\ncontradiction. Similarly if b 0",
        "page": 14
    },
    {
        "chunk": " then b is positive, and again a+b = 0 is\npositive by Proposition 2.2.8, a contradiction. Thus a and b must both\nbe zero.\n☐\n\nLemma 2.2.10. Let a be a positive number. Then there exists exactly\none natural number b such that b++ = a.\n\nProof. See Exercise 2.2.2.\n\n☐\n\nOnce we have a notion of addition, we can begin defining a notion\nof order.\n\nDefinition 2.2.11 (Ordering of the natural numbers). Let n and m be\nnatural numbers. We say that n is greater than or equal to m, and write\nn ≥ m or m ≤ n, iff we have n = m + a for some natural number a.\nWe say that n is strictly greater than m, and write n > m or m < n, iff\nn ≥ m and n# m.\n\nThus for instance 8 > 5, because 8 = 5+3 and 8 $ 5. Also note that\nn++ > n for any n; thus there is no largest natural number n, because\nthe next number n++ is always larger still.\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"28\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nProposition 2.2.12 (Basic properties of order for natural number",
        "page": 15
    },
    {
        "chunk": "s).\nLet a, b, c be natural numbers. Then\n\n(a) (Order is reflexive) a ≥ a.\n\n(b) (Order is transitive) If a ≥ b and b > c, then a ≥ c.\n\n(c) (Order is anti-symmetric) If a ≥ b and b > a, then a = b.\n\n(d) (Addition preserves order) a ≥ b if and only if a + c ≥ b+c.\n\n(e) a < b if and only if a++ ≤ b.\n\n(f) a <b if and only if b = a + d for some positive number d.\n\nProof. See Exercise 2.2.3.\n☐\n\nProposition 2.2.13 (Trichotomy of order for natural numbers). Let a\nand b be natural numbers. Then exactly one of the following statements\nis true: a < b, a = b, or a > b.\n\nProof. This is only a sketch of the proof; the gaps will be filled in Exer-\ncise 2.2.4.\n\nFirst we show that we cannot have more than one of the statements\na < b, a = b, a > b holding at the same time. If a < b then a + b by\ndefinition, and if a > b then a + b by definition. If a > b and a < b then\nby Proposition 2.2.12 we have a = b, a contradiction. Thus no more\nthan one of the statements is true.\n\nNow we show that at least one of ",
        "page": 15
    },
    {
        "chunk": "the statements is true. We keep b\nfixed and induct on a. When a = 0 we have 0 ≤ b for all b (why?), so\nwe have either 0 = b or 0 < b, which proves the base case. Now suppose\nwe have proven the proposition for a, and now we prove the proposition\nfor a++. From the trichotomy for a, there are three cases: a < b, a = b,\nand a > b. If a > b, then a++ > b (why?). If a = b, then a++ > b\n(why?). Now suppose that a < b. Then by Proposition 2.2.12, we have\na++ ≤ b. Thus either a++ = b or a++ < b, and in either case we are\ndone. This closes the induction.\n☐\n\nThe properties of order allow one to obtain a stronger version of the\nprinciple of induction:\n\nProposition 2.2.14 (Strong principle of induction). Let m0 be a natu-\nral number, and let P(m) be a property pertaining to an arbitrary natural\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"29\" -->\n<!-- PageHeader=\"2.3. Multiplication\" -->\n\nnumber m. Suppose that for each m > mo, we have the following im-\nplication: if P(m') is true for all natural numbers ",
        "page": 16
    },
    {
        "chunk": "mo ≤ m' <m, then\nP(m) is also true. (In particular, this means that P(m0) is true, since\nin this case the hypothesis is vacuous.) Then we can conclude that P(m)\nis true for all natural numbers m ≥ m0.\n\nRemark 2.2.15. In applications we usually use this principle with m0 =\n0 or m0 = 1.\n\nProof. See Exercise 2.2.5.\n☐\n\n\n## - Exercises -\n\nExercise 2.2.1. Prove Proposition 2.2.5. (Hint: fix two of the variables and\ninduct on the third.)\n\nExercise 2.2.2. Prove Lemma 2.2.10. (Hint: use induction.)\n\nExercise 2.2.3. Prove Proposition 2.2.12. (Hint: you will need many of the\npreceding propositions, corollaries, and lemmas.)\n\nExercise 2.2.4. Justify the three statements marked (why?) in the proof of\nProposition 2.2.13.\n\nExercise 2.2.5. Prove Proposition 2.2.14. (Hint: define Q(n) to be the property\nthat P(m) is true for all m0 ≤ m<n; note that Q(n) is vacuously true when\nn<m0.)\n\nExercise 2.2.6. Let n be a natural number, and let P(m) be a property per-\ntaining to the natural numbers such that when",
        "page": 16
    },
    {
        "chunk": "ever P(m++) is true, then P(m)\nis true. Suppose that P(n) is also true. Prove that P(m) is true for all natural\nnumbers m ≤ n; this is known as the principle of backwards induction. (Hint:\napply induction to the variable n.)\n\n\n## 2.3 Multiplication\n\nIn the previous section we have proven all the basic facts that we know to\nbe true about addition and order. To save space and to avoid belaboring\nthe obvious, we will now allow ourselves to use all the rules of algebra\nconcerning addition and order that we are familiar with, without further\ncomment. Thus for instance we may write things like a + b + c = c+\nb + a without supplying any further justification. Now we introduce\nmultiplication. Just as addition is the iterated increment operation,\nmultiplication is iterated addition:\n\nDefinition 2.3.1 (Multiplication of natural numbers). Let m be a nat-\nural number. To multiply zero to m, we define 0 x m := 0. Now suppose\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"30\" -->\n<!-- PageHeader=\"2. Starting",
        "page": 17
    },
    {
        "chunk": " at the beginning: the natural numbers\" -->\n\ninductively that we have defined how to multiply n to m. Then we can\nmultiply n++ to m by defining (n++) x m := (n x m) + m.\n\nThus for instance 0 x m = 0, 1 x m = 0 + m, 2 x m = 0+m+m,\netc. By induction one can easily verify that the product of two natural\nnumbers is a natural number.\n\nLemma 2.3.2 (Multiplication is commutative). Let n, m be natural\nnumbers. Then n x m = mx n.\n\nProof. See Exercise 2.3.1.\n☐\n\nWe will now abbreviate n x m as nm, and use the usual convention\nthat multiplication takes precedence over addition, thus for instance\nab + c means (a x b) + c, not a x (b+c). (We will also use the usual\nnotational conventions of precedence for the other arithmetic operations\nwhen they are defined later, to save on using parentheses all the time.)\n\nLemma 2.3.3 (Positive natural numbers have no zero divisors). Let\nn, m be natural numbers. Then n x m = 0 if and only if at least one of\nn, m is equal to zero. In particular, if n and m are bot",
        "page": 17
    },
    {
        "chunk": "h positive, then\nnm is also positive.\n\nProof. See Exercise 2.3.2.\n☐\n\nProposition 2.3.4 (Distributive law). For any natural numbers a, b, c,\nwe have a(b + c) = ab + ac and (b + c)a = ba + ca.\n\nProof. Since multiplication is commutative we only need to show the first\nidentity a(b + c) = ab + ac. We keep a and b fixed, and use induction\non c. Let's prove the base case c = 0, i.e., a(b+0) = ab + a0. The\nleft-hand side is ab, while the right-hand side is ab + 0 = ab, so we are\ndone with the base case. Now let us suppose inductively that a(b+c) =\nab + ac, and let us prove that a(b + (c++)) = ab + a(c++). The left-\nhand side is a((b+c)++) = a(b+c) +a, while the right-hand side is\nab + ac + a = a(b+c) + a by the induction hypothesis, and so we can\nclose the induction.\n☐\n\nProposition 2.3.5 (Multiplication is associative). For any natural\nnumbers a, b, c, we have (a x b) x c = a x (b x c).\n\nProof. See Exercise 2.3.3.\n☐\n\n<!-- PageBreak -->\n\n<!-- PageNumber=\"31\" -->\n<!-- PageHeader=\"2.3. Multiplic",
        "page": 18
    },
    {
        "chunk": "ation\" -->\n\nProposition 2.3.6 (Multiplication preserves order). If a, b are natural\nnumbers such that a < b, and c is positive, then ac < bc.\n\nProof. Since a < b, we have b = a + d for some positive d. Multiplying\nby c and using the distributive law we obtain bc = ac + dc. Since\nd is positive, and c is positive, dc is positive, and hence ac < bc as\ndesired.\n☐\n\nCorollary 2.3.7 (Cancellation law). Let a, b, c be natural numbers such\nthat ac = bc and c is non-zero. Then a = b.\n\nRemark 2.3.8. Just as Proposition 2.2.6 will allow for a \"virtual sub-\ntraction\" which will eventually let us define genuine subtraction, this\ncorollary provides a \"virtual division\" which will be needed to define\ngenuine division later on.\n\nProof. By the trichotomy of order (Proposition 2.2.13), we have three\ncases: a < b, a = b, a > b. Suppose first that a < b, then by Propo-\nsition 2.3.6 we have ac < bc, a contradiction. We can obtain a similar\ncontradiction when a > b. Thus the only possibility is that a = b, a",
        "page": 18
    },
    {
        "chunk": "s\ndesired.\n☐\n\nWith these propositions it is easy to deduce all the familiar rules of\nalgebra involving addition and multiplication, see for instance Exercise\n2.3.4.\n\nNow that we have the familiar operations of addition and multipli-\ncation, the more primitive notion of increment will begin to fall by the\nwayside, and we will see it rarely from now on. In any event we can\nalways use addition to describe incrementation, since n++ = n + 1.\n\nProposition 2.3.9 (Euclidean algorithm). Let n be a natural number,\nand let q be a positive number. Then there exist natural numbers m, r\nsuch that 0 < r < q and n = mq + r.\n\nRemark 2.3.10. In other words, we can divide a natural number n by\na positive number q to obtain a quotient m (which is another natural\nnumber) and a remainder r (which is less than q). This algorithm marks\nthe beginning of number theory, which is a beautiful and important\nsubject but one which is beyond the scope of this text.\n\nProof. See Exercise 2.3.5.\n☐\n\n<!-- PageBreak -->\n\n<!",
        "page": 19
    },
    {
        "chunk": "-- PageNumber=\"32\" -->\n<!-- PageHeader=\"2. Starting at the beginning: the natural numbers\" -->\n\nJust like one uses the increment operation to recursively define ad-\ndition, and addition to recursively define multiplication, one can use\nmultiplication to recursively define exponentiation:\n\nDefinition 2.3.11 (Exponentiation for natural numbers). Let m be\na natural number. To raise m to the power 0, we define mº := 1; in\nparticular, we define 00 := 1. Now suppose recursively that m™ has been\ndefined for some natural number n, then we define m\"++ := m2 x m.\n\nExamples 2.3.12. Thus for instance x1 = x0 x x = 1 x x = x; x2 =\nx1 x x = x x x; x3 = x2 x x = x x x x x; and so forth. By induction we\nsee that this recursive definition defines x7 for all natural numbers n.\n\nWe will not develop the theory of exponentiation too deeply here,\nbut instead wait until after we have defined the integers and rational\nnumbers; see in particular Proposition 4.3.10.\n\n\n## - Exercises -\n\nExercise 2.3.1. Prove Lem",
        "page": 19
    },
    {
        "chunk": "ma 2.3.2. (Hint: modify the proofs of Lemmas 2.2.2,\n2.2.3 and Proposition 2.2.4.)\n\nExercise 2.3.2. Prove Lemma 2.3.3. (Hint: prove the second statement first.)\n\nExercise 2.3.3. Prove Proposition 2.3.5. (Hint: modify the proof of Proposition\n2.2.5 and use the distributive law.)\n\nExercise 2.3.4. Prove the identity (a + b)2 = a2 + 2ab + b2 for all natural\nnumbers a, b.\n\nExercise 2.3.5. Prove Proposition 2.3.9. (Hint: fix q and induct on n.)\n",
        "page": 19
    }
]